#+TITLE:     Flowbite
#+AUTHOR:    David Conner
#+EMAIL:     aionfork@gmail.com
#+DESCRIPTION: notes

#+begin_src emacs-lisp
(setq-local fb-ecto (expand-file-name "typescript/components/flowbite/flowbite" (getenv "_ECTO")))
#+end_src

*** Templatize

#  :noweb-ref fbContentTypes :noweb-sep ""

#+name: fbContentTypes
#+begin_src emacs-lisp :results value
'(components typography forms customize plugins)
#+end_src

#+RESULTS: fbContentTypes
: (components typography forms customize plugins)

Reset directory structure

#+headers: :var fb_ecto=(identity fb-ecto) content_types=fbContentTypes
#+begin_src sh :results output verbatim :noweb yes
# hmmmm ... wasn't sure whether everything would be properly grouped
#[[ ! -d "components" ]] && mkdir components
#[[ ! -d "typography" ]] && mkdir typography

string_join() { local IFS="$1"; shift; echo "$*"; }

content_regex="$(string_join '|' ${content_types[@]} | sed -e 's/|/\\|/g')" #damit

for d in ${content_types[@]}; do
    [[ -d "$d" ]] && rm -f "$d"/**/*.html

    grep -he '^{{< example.*id=.* >}}'  $fb_ecto/content/$d/*.md |\
    sed -e 's/^{{< example .*github="\('$content_regex'\)\/\([a-zA-Z0-9.-]\+\)\.md".*/\1\/\2/g' |\
    sort | uniq | xargs -n1 mkdir -p
done

for d in ${content_types[@]}; do
    echo "$d: $(ls $d | wc -l) directories"
done

# # almost works:
# # echo ls -al ./${content_types[@]}/*
# #   ls -al ./components typography forms customize/*
# # can't pipe: pushd $fb_ecto
#+end_src

#+RESULTS:
: components: 42 directories
: typography: 9 directories
: forms: 11 directories
: customize: 1 directories
: plugins: 1 directories

#+headers: :var fb_ecto=(identity fb-ecto) content_types=fbContentTypes
#+begin_src sh :results output silent

# {{< example id="iphone-mockup" github="components/device-mockups.md" show_dark=true >}}
# {{< example id="android-mockup" github="components/device-mockups.md" show_dark=true >}}
for d in ${content_types[@]}; do
    awk -f extractComponents.awk $fb_ecto/content/$d/*.md
done
#+end_src

Format HTML

#+headers: :var fb_ecto=(identity fb-ecto) content_types=fbContentTypes
#+begin_src sh :results output silent
for t in ${content_types[@]}; do
    npx prettier -w $t/**/*.html
done
#+end_src

